Autodesk.Navisworks.Api.Plugins.EventWatcherPluginRecord
Record representing a EventWatcherPlugin

Autodesk.Navisworks.Api.Plugins.EventWatcherPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.EventWatcherPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.EventWatcherPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load